<h1> MySQL Using Pyhton </h1>
<h3>
Python can be used in database applications.
One of the most popular databases is MySQL.<br>
Use pip install mysql-connector-pyhton </h2>

In [ ]:
import mysql.connector

<h2>Connecting to SQL</h2>

In [3]:
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = '######'
)

In [4]:
print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x07EE41C0>

<h2> Creating Table in Databases </h2>

In [8]:
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = '######',
    database = 'sql_using_python'
)

mycursor = mydb.cursor()

In [9]:
mycursor.execute('create table students( name varchar(100), city varchar(100) )')

<h2>Show Tables in your Database </h2>

In [14]:
mycursor.execute('show tables')

for x in mycursor:
    print(x)

('students',)

<h2> Adding Primary Key to Students Table </h2>

In [15]:
mycursor.execute('alter table students add column ID int auto_increment primary key')

<h2>Adding rows in Table </h2>

In [23]:
sql = 'insert into students (name, city) values (%s, %s)'
val = ('Honey','Panipat')

mycursor.execute(sql, val)

mydb.commit()

In [25]:
print(mycursor.rowcount, "rows affected")

1 rows affected

In [28]:
mycursor = mydb.cursor()

sql = 'insert into students (name, city) values (%s, %s)'
val = [
    ('John', 'Jalandhar'),
    ('Jashan', 'Sirhind'),
    ('Arsh', 'Ludhiana'),
    ('Navkash', 'Faridkot')
]

mycursor.executemany(sql, val)

mydb.commit()

In [29]:
print(mycursor.rowcount, "rows affected")

4 rows affected

<h2>Fetching rows from table</h2>

In [32]:
mycursor.execute('select * from students')

rows = mycursor.fetchall()

for i in rows:
    print(i)

('Honey', 'Panipat', 1)
('John', 'Jalandhar', 2)
('Jashan', 'Sirhind', 3)
('Arsh', 'Ludhiana', 4)
('Navkash', 'Faridkot', 5)
('John', 'Jalandhar', 6)
('Jashan', 'Sirhind', 7)
('Arsh', 'Ludhiana', 8)
('Navkash', 'Faridkot', 9)

<h4>I have mistakenly executed the insert command twice ,therefore we need to delete the extra rows</h4>

In [ ]:
mycursor.execute('delete from students where Id between 6 and  9')

mydb.commit()

In [34]:
mycursor.execute('select * from students')

rows = mycursor.fetchall()

for i in rows:
    print(i)

('Honey', 'Panipat', 1)
('John', 'Jalandhar', 2)
('Jashan', 'Sirhind', 3)
('Arsh', 'Ludhiana', 4)
('Navkash', 'Faridkot', 5)

<h2> Manipulating Data </h2>

<h4>Filtering Using Where Clause </h4>

In [68]:
mycursor = mydb.cursor()

mycursor.execute('select * from students where ID > 2')

result_set = mycursor.fetchall()

for rows in result_set:
    print(rows)

('Jashan', 'Sirhind', 3, None)
('Ankit', 'Ludhiana', 4, None)
('Navkash', 'Faridkot', 5, None)
(None, None, 10, 20)
(None, None, 11, 30)

In [44]:
mycursor = mydb.cursor()

sql = ' select * from students where city in ( "Panipat" , "Ludhiana") '

mycursor.execute(sql)

result_set = mycursor.fetchall()

for rows in result_set:
    print(rows)

('Honey', 'Panipat', 1)
('Arsh', 'Ludhiana', 4)

In [49]:
mycursor = mydb.cursor()

sql = ' select * from students where name like "%a%" '

mycursor.execute(sql)

result_set = mycursor.fetchall()

for rows in result_set:
    print(rows)

('Jashan', 'Sirhind', 3)
('Arsh', 'Ludhiana', 4)
('Navkash', 'Faridkot', 5)

In [55]:
mycursor = mydb.cursor()

sql = ' select * from students order by name desc'

mycursor.execute(sql)

result_set = mycursor.fetchall()

for rows in result_set:
    print(rows)

('Navkash', 'Faridkot', 5)
('John', 'Jalandhar', 2)
('Jashan', 'Sirhind', 3)
('Honey', 'Panipat', 1)
('Arsh', 'Ludhiana', 4)

<h4>Updating Data in the table </h4>

In [64]:
mycursor = mydb.cursor()

sql = ' update students set name = %s where name = %s '
val = ("Ankit" , "Arsh")

mycursor.execute(sql , val)

mydb.commit()

In [65]:
mycursor = mydb.cursor()

sql = ' select * from students'

mycursor.execute(sql)

result_set = mycursor.fetchall()

for rows in result_set:
    print(rows)

('Honey', 'Panipat', 1, None)
('John', 'Jalandhar', 2, None)
('Jashan', 'Sirhind', 3, None)
('Ankit', 'Ludhiana', 4, None)
('Navkash', 'Faridkot', 5, None)
(None, None, 10, 20)
(None, None, 11, 30)